---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookStartPlaneAngle
source: html/fbd36955-6804-f399-8662-c8b2519fd5ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookStartPlaneAngle Property

"Hook Orientation At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarFreeFormHookStartPlaneAngle { get; }
```